{
  "backend/main.mo": "Main backend actor defining Game and UserProfile types, managing games and user profiles with Map storage, and providing admin-gated game management functions plus user profile access with authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including homepage design, store description section, game catalog with horizontal scrolling, and WhatsApp Buy Now integration with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, pages, hooks, and utilities for the Dragon Games Store application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space for the application's design system.",
  "frontend/index.html": "HTML entry point with Dragon Games Store title, root div for React mounting, and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component setting up TanStack Router with home and admin routes, QueryClient provider, and shared layout including Header, Footer, and ProfileSetupModal.",
  "frontend/src/components/AddGameForm.tsx": "Admin form component for adding games with inputs for name, image upload with progress tracking, trailer URL, description, and price, using ExternalBlob for image handling.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice with current year and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/GameCard.tsx": "Game card component displaying game image, SALE badge, price badge in top-right corner, game name, and Buy Now button that opens WhatsApp or detail modal on click.",
  "frontend/src/components/GameCatalog.tsx": "Horizontal scrolling game catalog with left/right chevron navigation buttons that show/hide based on scroll position, displaying GameCard components for each game.",
  "frontend/src/components/GameDetailModal.tsx": "Modal component that displays detailed game information including an embedded YouTube trailer, description, price, and a WhatsApp purchase button.",
  "frontend/src/components/Header.tsx": "Header component with logo/title navigation to home and a conditional admin settings button shown only to admin users.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that toggles between login and logout states, handling Internet Identity authentication and clearing query cache on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that prompts authenticated users without a profile to enter their name, blocking interaction until profile is saved.",
  "frontend/src/components/StoreDescription.tsx": "Static marketing section displaying store introduction, platform icons (PC, PS4, PS5, Xbox), customer count, and key features.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useAddGame.ts": "Mutation hook for adding a new game to the backend, invalidating the games query on success.",
  "frontend/src/hooks/useGames.ts": "Query hook that fetches the list of games from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for managing Internet Identity authentication, including login, logout, identity storage, and authentication status tracking.",
  "frontend/src/hooks/useQueries.ts": "Query and mutation hooks for fetching and saving the current user's profile.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (light/dark mode) and utility classes for scrollbar hiding.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin-only page that checks authentication and admin status, displaying the AddGameForm component or access denied messages accordingly.",
  "frontend/src/pages/HomePage.tsx": "Main landing page that renders the store description section followed by the game catalog.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/src/utils/whatsapp.ts": "Generates WhatsApp URL with pre-filled message for ordering games, targeting phone number 918757242955 with dynamic price formatting.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme for sidebar/chart/card components, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata defining Dragon Games Store as a horizontal-scrolling gaming marketplace with WhatsApp integration, admin panel, Internet Identity auth, and existing features including homepage, game catalog, and admin management capabilities."
}